# GetRectangularWidth Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop..::..GetRectangularWidth Method
CurveLoop Class See Also
---
Returns the width of a curve loop if it is rectangular with respect to the projection plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double GetRectangularWidth(
	Plane plane
)
```

Visual Basic
---
```text
Public Function GetRectangularWidth ( _
	plane As Plane _
) As Double
```

Visual C++
---
```text
public:
double GetRectangularWidth(
	Plane^ plane
)
```

# ### Parameters
plane
    Type: Autodesk.Revit.DB..::..Plane The plane to which the curves will be projected.
# ### Return Value
The width.
# Remarks
The width is determined by the U extents of the UV curve created by from the curve loop plane.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The curve loop is not rectangular when projected to the input plane. |

# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace